Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་གྲགས་པ་ཡིས། །ཕྱོགས་བཞིའི་དགེ་འདུན་དག་ལ་རྫིང་ཕུལ་ནས། །དེ་བཞིན་གཤེགས་པ་བློ་གྲོས་བཟང་པོ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Meruyaśas Offered a pond to the saṅgha of the four directions Before the thus-gone Excellent Intelligence And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་བཅུ་པ་ལྷ་བུའི་ཚེ། །བདེ་གཤེགས་གཟི་བརྗིད་མཐའ་ཡས་བྱང་ཆུབ་སྙིང་པོར་ནི། །སྙོམས་པར་ཞུགས་པའི་ཚེ་ན་སོར་མོ་ལྔ་བསྲེགས་ནས། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Daśaraśmi, when a divine son, Burned five fingers when the well-gone Infinite Splendor Had entered equipoise at the seat of awakening, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མ་སྨད་ཤིང་རྟ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ཕྱག་དེ་ལ། །ལོ་མ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anindita, when a chariot maker, Offered leaves To the thus-gone Lion Hand And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གླང་པོའི་འགྲོས་ནི་གྲོང་ཁྱེར་དུ། །རྟེན་པའི་ཚེ་ན་བདེ་གཤེགས་བློ་སྣང་ལ། །ཤ་མ་ཀ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nāgakrama, when a city beggar, Offered a śamaka plant To the well-gone Mental Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡིད་འཐད་གནག་ལྷས་སྲུང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡི་རྒྱལ་པོ་ལ། །དར་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Manoratha, when the guard of a cow stable, Offered buttermilk To the thus-gone King of Gods And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་ཟླ་བ་ལམ་སྟོན་ཚེ། །བདེ་གཤེགས་བདེན་པའི་ཏོག་གི་ལམ་དག་ཏུ། །གོས་ཀྱི་གདན་དག་གདིང་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnacandra, when a guide, Prepared a seat made of clothing For the well-gone Truth Crest when he was traveling, And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཞི་བ་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལེགས་པར་གནས་དེ་ལ། །ཨུད་པ་ལ་ཡི་བཀྲུ་སྨན་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Śānta, when a physician, Offered a purgative made from utpalas To the thus-gone Excellent Abiding And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རབ་གསལ་རྒྱལ་པོ་སྤོང་བརྩོན་པའི། །དགེ་སློང་ཚེ་ན་བདེ་གཤེགས་དཔག་མེད་པའི། །ལྷ་ལ་ཨ་ཡོ་ག་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Pradyotarāja, when a monk endeavoring in relinquishment, Offered ayoga To the thus-gone Unfathomable Deity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཁ་ལོ་སྒྱུར་བ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཕགས་པའི་མེ་ཏོག་ལ། །ཙན་དན་དམར་པོའི་ཁང་བཟངས་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sārathi, when a captain, Offered a mansion made of red sandalwood To the thus-gone Superior Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགའ་བའི་དབང་ཕྱུག་ཕྱུག་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོད་སྦྱིན་ཆེན་པོ་ལ། །རོལ་མོའི་སྒྲ་ཡིས་མཆོད་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Nandeśvara, when a wealthy man, Offered music To the thus-gone Great Sacrifice And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཙུག་ན་རིན་ཆེན་རྩིས་པ་ཡི། །ཁྱེའུ་ཚེ་དེ་བཞིན་གཤེགས་པ་ཏོག་ཆེན་ལ། །མཚུངས་པ་མེད་པའི་ཕྱེ་མ་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnacūḍa, when a young astrologer, Scattered unparalleled powders To the thus-gone Great Crest And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བསྙེངས་བྲལ་རྩྭ་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་དེ་ལ། །ཀ་པིད་ཏ་ཡི་ཕུར་མ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vigatabhaya, when a hay seller, Offered vessels of kapittha To the thus-gone Sunlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྒྲ་གཅན་ལྷ་ནི་ཤིང་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་འོད་དེ་ལ། །རྩྭ་ལས་བྱས་པའི་མཆིལ་ལྷམ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rāhudeva, when a timber merchant, Offered footwear made of straw To the thus-gone Jewel Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ན་ཚོད་བཟང་པོ་གྲོང་སྲུངས་ཚེ། །གྲོང་ཁྱེར་དག་གི་སྒོ་ནི་ཕྱེ་ནས་ཀྱང་། །དེ་བཞིན་གཤེགས་པ་རྨ་བྱའི་ང་རོ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suvayas, when a city guard, Opened the city gate For the thus-gone Peacock Call And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལྷ་དགའ་སྨན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཀུན་ཏུ་རྣམ་རྒྱལ་ལ། །ཤི་རི་ཤ་ཡི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Amarapriya, when a physician, Scattered śirīṣa flowers Before the thus-gone Universal Victor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་ཕུང་པོ་སྨད་འཚོང་མའི། །གཙོ་མོའི་ཚེ་ན་བདེ་གཤེགས་འབྱོར་འོད་ལ། །ན་བ་མ་ལའི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnaskandha, when a leader of prostitutes, Scattered navamallikā flowers Before the well-gone Light of Wealth And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཛེས་གཤེགས་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྤྱན་ནི་མཐའ་ཡས་ལ། །ཨུད་པ་ལ་ནི་གཅིག་ཅིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Laḍitavikrama, when the son of a merchant, Offered a single utpala To the thus-gone Infinite Eye And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་ཕྱོགས་བཙོ་བླག་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྙན་པར་དགྱེས་དེ་ཡི། །ན་བཟའ་བཀྲུ་བཤལ་དག་ནི་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhapakṣa, when a washerman, Washed the garments Of the thus-gone Delightful Joy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཤིན་ཏུ་མཐོར་གཤེགས་གླང་པོ་ཆེའི། །རྫིའི་ཚེ་དེ་བཞིན་གཤེགས་པ་བདེ་གཤེགས་ཀྱི། །གདན་ནི་འབའ་ཏི་ཤིང་དྲུང་བཏིང་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Atyuccagāmin, when an elephant herder, Prepared a seat in front of a ’ba ti tree For the thus-gone Well-Gone One And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐྱེ་དབང་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གསལ་བའི་ལྷ་དེ་ལ། །ཏྲེ་ཀ་ནི་ཡི་མེ་ཏོག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Janendra, when a city beggar, Offered trekani flowers To the thus-gone God of Clarity And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གྲོས་བཟང་པོ་གྲོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐའ་ཡས་གཤེགས་དེ་ལ། །ཨ་མྲའི་ལྕུག་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sumati, when the head of a city, Offered mango tree shoots To the thus-gone Infinite Departure And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་འོད་ནི་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡུལ་འཁོར་ལྷ་དེ་ལ། །སྤོས་རྣམས་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokaprabha, when an incense merchant, Offered the finest incense To the thus-gone God of the Land And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་གཟི་བརྗིད་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བློ་ཟབ་དེ་ལ་ནི། །བལ་དང་འབྲས་བུ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnatejas, when a brahmin, Offered wool and fruit To the thus-gone Profound Mind And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྐལ་ལྡན་ཤིང་རྟ་རྩྭ་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྡེ་ཡི་འགྲོས་དེ་ལ། །མེ་ཏོག་ཆུན་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhāgīrathi, when a grass seller, Offered a bouquet of flowers To the thus-gone Group Movement And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཀུན་རྒྱལ་འཁྲུལ་འཁོར་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བའི་འོད་དེ་ལ། །དར་གྱི་ལྡ་ལྡི་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Saṃjaya, when a maker of devices, Offered silk tassels To the thus-gone Moonlight And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དགའ་བ་བཀོད་པ་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཕུང་པོ་ལ། །འོ་མར་བཅས་པའི་འབྲས་ཅན་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Rativyūha, when a merchant, Offered rice cooked with milk To the thus-gone Mass of Splendor And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྟེགས་ནི་མཛད་པ་པོ། །ཤིང་རྟ་མཁན་ཚེ་བདེ་གཤེགས་དགྱེས་ཆུང་ལ། །ཤིང་ལས་བྱས་པའི་མཆིལ་ལྷམ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Tīrthakara, when a chariot maker, Offered wooden footwear To the well-gone Delighting in Less And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སྤོས་ཀྱི་གླང་པོ་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་ཆེན་པོ་ལ། །རྨ་བྱའི་བསིལ་ཡབ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Gandhahastin, when a householder, Offered a fan of peacock feathers To the thus-gone Great Power And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བློ་གྲོས་འོད་འཕྲོ་རྒྱལ་པོ་ཡི། །བཙུན་མོའི་ཚེ་ན་བདེ་གཤེགས་རྒྱལ་སྡེ་ལ། །མེ་ཏོག་པར་ཤི་ཆང་པ་གང་ཕུལ་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arciṣmati, when a queen, Offered a bundle of vārṣikī flowers To the well-gone Victorious Army And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རི་བོ་རྒྱལ་མཚན་ཁྱེ་འུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་གཤེགས་དེ་ལ། །ལག་པ་འདག་པའི་ཆལ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Merudhvaja, when a young boy, Offered hand soap To the thus-gone Accomplished Departure And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྤོས་བཟངས་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཟླ་བ་སྡུག་དེ་ལ། །མེ་ཏོག་ཆུན་པོ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sugandha, when a merchant, Offered a bouquet of flowers To the thus-gone Lovely Moon And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་བརྟན་ནོར་བུ་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་སེང་གེའི་ང་རོ་ལ། །རིན་པོ་ཆེ་ཡི་གདུགས་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Dṛḍhadharma, when a jeweler, Offered a jewel-studded parasol To the thus-gone Lion’s Roar And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གཟི་བརྗིད་དྲག་ཤུལ་གསེར་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་སྟོན་པ་གསལ་དེ་ལ། །གསེར་གྱི་མེ་ཏོག་དག་ནི་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ugratejas, when a goldsmith, Scattered flowers of gold To the thus-gone Clear Teacher And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཆོས་ཀྱི་ནོར་བུ་དེད་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཡེ་ཤེས་ཕུང་པོ་ལ། །མུ་ཏིག་དམར་པོ་དག་ནི་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṇidharman, when a captain, Scattered red pearls To the thus-gone Masses of Wisdom And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བཟང་བྱིན་གྲོང་ཁྱེར་རྟེན་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་མེ་ཏོག་ལ། །བཤོས་དྲོན་བསོད་སྙོམས་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Bhadradatta, when a city beggar, Offered a cooked meal consisting of alms To the thus-gone Splendid Flower And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཟླ་བ་ཕྲེང་རྒྱུད་མཁན་གྱི་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་ཕུང་པོ་ལ། །ཨུད་པལ་ལྔ་ཞིག་གཏོར་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Candra, when a garland maker, Scattered five utpalas Before the thus-gone Mass of Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཚངས་དབྱངས་ལག་བླ་བྱེད་པའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྫུ་འཕྲུལ་འོད་དེ་ལ། །ཚེམས་ཤིང་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Brahmasvara, when a supervisor of a new building, Offered toothsticks To the thus-gone Miraculous Light And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་ཟླ་བ་རྒྱལ་པོ་ཡི། །ཕོ་ཉ་བྱེད་ཚེ་བདེ་གཤེགས་གཟི་མཐའ་ཡས། །དེ་ལ་མཆིལ་ལྷམ་དག་ནི་དབུལ་བྱས་ནས། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhacandra, when a royal messenger, Offered footwear To the well-gone Infinite Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དཔལ་ནི་ཚོང་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་འོད་ཟེར་མཐའ་ཡས་ལ། །གསེར་གྱི་ཕྲེང་བ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Śrī, when the son of a merchant, Offered garlands of gold To the thus-gone Infinite Radiance And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ལེགས་སྐྱེས་གསེར་མགར་ཚེ། །དེ་བཞིན་གཤེགས་པ་དཔལ་གྱི་སྙིང་པོ་ལ། །རིན་པོ་ཆེ་ཡི་སྡོང་བུ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Sujāta, when a goldsmith, Offered a jeweled staff To the thus-gone Essence of Glory And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐུབ་མེད་ཚོགས་ནི་འདུན་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་གྲགས་པ་ལ། །སྦྲང་རྩིར་བྱས་པའི་འོ་མ་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ajitagaṇa, when the son of a chief councillor, Offered milk with honey To the thus-gone Famed Illuminator And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གྲགས་པའི་བཤེས་གཉེན་ཚོང་དཔོན་གྱི། །བུར་གྱུར་ཚེ་ན་བདེ་གཤེགས་བདེན་ཏོག་ལ། །མེ་ཏོག་དག་གི་ཕྲེང་བ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Yaśomitra, when the son of a merchant, Offered a flower garland To the well-gone Truth Crest And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བདེན་པ་ཕྲེང་རྒྱུད་ཚེ། །དེ་བཞིན་གཤེགས་པ་གཟི་བརྗིད་དྲག་ཤུལ་ལ། །མེ་ཏོག་ཆང་པ་གང་ཞིག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Satya, when a garland maker, Offered a bundle of flowers To the thus-gone Fierce Splendor And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དཀའ་ཐུབ་ཆེན་པོ་ཚོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཉི་མའི་ཏོག་དེ་ལ། །འཁོར་རྣམས་ཐམས་ཅད་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Mahātapas, when a merchant, Offered his entire retinue To the thus-gone Sun Crest And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལྷུན་པོའི་འོད་ཟེར་འཁོར་སྒྱུར་རྒྱལ་པོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷུན་པོ་ཆེན་པོ་དེ་ལ་ནི། །རིན་ཆེན་ཡུ་བར་བཅས་པའི་གདུགས་འབུམ་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Meruraśmi, when a universal monarch, Offered one million parasols with jewel handles To the thus-gone Majestic Mountain And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཡོན་ཏན་བརྩེགས་པ་དེད་དཔོན་བུར་གྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོད་པ་བཀོད་པ་དེ་ལ་ནི། །རིན་ཆེན་སྣམ་བུ་ལྡ་ལྡི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Guṇakūṭa, when the son of a captain, Offered a precious blanket with tassels To the thus-gone Array of Offerings And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་མཆོད་གྲགས་སཱལ་ཆེན་ལྟ་བུའི་བྲམ་ཟེ་ཚེ། །འཁོར་ནི་བྱེ་བར་བཅས་པའི་དེ་བཞིན་གཤེགས་པ་པོ། །འཇིག་རྟེན་རྣམ་པར་གྲགས་ལ་ཁྲུས་ཀྱི་ཡོ་བྱད་ཕུལ། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Arhadyaśas, when a prosperous brahmin, Offered bathing utensils To the thus-gone Famed throughout the World and his ten millionfold retinue And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་གྲགས་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དྲག་ཤུལ་བྱིན་པ་ཡི། །འཆག་ས་དག་ནི་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dharmakīrti, when a guide, Swept a monastic walkway For the thus-gone Fierce Gift And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྦྱིན་འོད་དཔའ་བོའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཆོག་ཏུ་གྲགས་དེ་ལ། །རྒྱལ་མཚན་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Dānaprabha, when a hero, Offered banners To the thus-gone Supreme Fame And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གློག་འབྱིན་གྲོང་དཔོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་དོན་གྲུབ་མཐུ་རྩལ་ལ། །གདིང་བ་དག་ནི་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Vidyuddatta, when the head of a city, Offered cushioned seats To the thus-gone Powerful Accomplishment And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་བདེན་གསུང་ཁྱིམ་བདག་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་ཡིས་མཆོད་དེ་ལ། །སྦྲང་རྩིར་བཅས་པའི་འབྲས་ཆན་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Satyakathin, when a householder, Offered cooked rice with honey To the thus-gone Worshiped by Gods And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཚོ་བྱེད་ལྷ་རིས་པ་ཡི་ཚེ། །དེ་བཞིན་གཤེགས་པ་བདེན་པ་པོ་དེ་ཡི། །གཙུག་ལག་ཁང་ནི་ཕྱག་དར་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jīvaka, when a god, Swept a monastic temple To the thus-gone Truthful And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ན་ཚོད་བཟང་པོ་རྩྭ་འཚོང་ཚེ། །བདེ་གཤེགས་ཟིལ་གྱིས་མི་ནོན་གྲགས་པ་ལ། །རྩྭ་ཡི་སྒྲོན་མ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Suvayas, when a grass seller, Offered straw lamps To the well-gone Indomitable Fame And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ལེགས་པའི་ཚོགས་ཅན་འཁོར་སྒྱུར་ཚེ། །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་འོད་དེ་ལ། །ན་བཟའ་རིན་པོ་ཆེ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sadgaṇin, when a universal monarch, Offered precious garments To the thus-gone Light of the Worthy Ones And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་ངེས་བློ་གྲོས་ཚོང་དཔོན་གྱི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་སྒྲོན་ཆེན་ལ། །མུ་ཀ་ཙན་ཏྲ་ཀ་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Viniścitamati, when the son of a merchant, Offered mu ka tsan dra ka To the thus-gone Great Lamp And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་སྲིད་མཐའ་ནོར་བུའི་སྤོས། །རིམ་གྲོ་པ་ཚེ་བདེ་གཤེགས་བློ་སྤྱོད་ལ། །ཆོས་ཀྱི་གདན་དག་བཤམ་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Bhavānta­maṇi­gandha, While attending to the well-gone Wisdom Practice, Prepared seats for the teaching of Dharma And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྒྱལ་བས་དགྱེས་པ་གོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཐུ་རྩལ་ཅན་དེ་ལ། །ཆོས་གོས་གསུམ་དག་དབུལ་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Jayanandin, when a garment merchant, Offered the three Dharma robes To the thus-gone Powerful And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་སེང་གེའི་འོད་ཟེར་ལམ་སྟོན་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐོགས་མེད་གཤེགས་པ་པོ། །ལམ་དུ་ཞུགས་ཚེ་བསྐོར་བ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃharaśmi, when a guide, Circumambulated the thus-gone Gone Unhindered When he was traveling, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རྣམ་པར་སྣང་མཛད་རིན་པོ་ཆེ། །རྟོག་ཤེས་ཚེ་ན་དེ་བཞིན་གཤེགས་པ་པོ། །ཡིད་གཉིས་སྤོང་བའི་འཆག་ས་བཤམས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Vairocana, when an expert on jewels, Prepared a monastic walkway For the thus-gone Abandoning Doubt And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་གྲགས་མཆོག་སྤོས་འཚོང་ཚེ། །དེ་བཞིན་གཤེགས་པ་བརྟུལ་ཞུགས་ཆེ་དེ་ལ། །སྣ་མའི་མེ་ཏོག་ཆུན་པོ་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Yaśottara, when an incense merchant, Offered a bouquet of sumanā flowers To the thus-gone Great Yogic Discipline And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ཐུགས་རབ་གཞུངས་པ་ཕྱག་དར་བའི། །བུ་ཚེ་དེ་བཞིན་གཤེགས་པ་ལྷ་གསལ་ལ། །མངོན་སུམ་དག་ཏུ་བསྟོད་པ་བྱས་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Sumedhas, when the son of a sweeper, Offered praises In the presence of the thus-gone Divine ClarityAnd in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནོར་བུའི་ཟླ་བ་ལྷ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་འཁྲུལ་མེད་གཤེགས་དེ་ལ། །ལྷ་ཡི་གཞལ་ཡས་ཁང་དག་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṇicandra, when a divine son, Offered a heavenly palace To the thus-gone Gone Beyond Delusion And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་དྲག་ཤུལ་འོད་ཟེར་དགོན་པ་ཡི། །དགེ་སློང་ཚེ་ན་བདེ་གཤེགས་ཡུལ་འཁོར་ལྷ། །དེ་ལ་ཆོས་གོས་སྣམ་སྦྱར་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ugraprabha, when a monk in a hermitage, Offered Dharma robes and shawls To the well-gone God of the Land And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་བརྟུལ་ཞུགས་ཐུབ་མེད་རྒྱལ་བུའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་མཛེས་པར་དགྱེས་དེ་ལ། །གདུགས་དང་དར་ཡུག་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Anihatavrata, when a prince, Offered a parasol and a roll of silk To the thus-gone Beautiful Delight And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་འགྲོས་མཆོད་གདོལ་བུའི་ཚེ། །ཉི་མ་འགའ་ཞིག་བསླབ་པ་ལྔ་མནོས་ནས། །དེ་བཞིན་གཤེགས་པ་མེ་ཏོག་དཔལ་དེ་ལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Jagatpūjita, when the son of an outcaste, Observed for some days the fivefold training Before the thus-gone Flower of Glory, And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་ནོར་བུའི་ཚོགས་ནི་བརྒྱ་བྱིན་ཚེ། །དེ་བཞིན་གཤེགས་པ་མི་འཇིགས་སྦྱིན་དེ་ལ། །གསེར་གྱི་ཤིང་རྟ་རྐྱེན་བཅས་སྟོང་སྙེད་ཕུལ། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Maṇigaṇa, when Śakra, Offered thousands of equipped golden chariots To the thus-gone Giver of Fearlessness And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་འཇིག་རྟེན་བླ་མ་བྲམ་ཟེའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ལྷ་དགའ་དེ་ལ་ནི། །མ་དྷུ་ཀ་ཡི་མེ་ཏོག་གཏོར་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Lokottara, when a brahmin, Scattered madhuka flowers Before the thus-gone Divine Joy And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་གླང་ཆེན་སེང་གེ་ལོང་བའི་ཚེ། །དེ་བཞིན་གཤེགས་པ་ཐར་པའི་འོད་དེ་ཡི། །འཆག་ས་དག་ནི་ཆག་ཆག་བཏབ་ནས་ཀྱང་། །དང་པོར་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Siṃhahastin, when a blind man, Sprinkled water on a monastic walkway Before the thus-gone Light of Liberation And in doing so first gave rise to the mind of awakening.

source: དེ་བཞིན་གཤེགས་པ་ཟླ་བ་རྒྱལ་པོའི་བུར་གྱུར་ཚེ། །ཟླ་བ་བཞིར་ནི་དགེ་སློང་དགེ་འདུན་ན་བ་ཡི། །གསོས་སྨན་དག་ལ་སྤྱན་དྲངས་བདེ་གཤེགས་འོད་འཕྲོ་ལ། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The thus-gone Candra, when a prince, Offered four months of medical supplies for the saṅgha of monks Before the well-gone Radiance And in doing so first gave rise to the mind of awakening.

source: བདེ་གཤེགས་རིན་ཆེན་འོད་ཟེར་འཁོར་ལོས་སྒྱུར་བ་ཡི། །བཙུན་མོའི་ཚེ་ན་བདེ་གཤེགས་ཡོན་ཏན་འབྱུང་གནས་ལ། །ཡུ་བ་ནོར་བུས་སྤྲས་པའི་རྔ་ཡབ་དག་ནི་ཕུལ་ནས་ཀྱང་། །དང་པོ་ཉིད་དུ་བྱང་ཆུབ་ཏུ་ནི་སེམས་བསྐྱེད་དོ། །
en: “The well-gone Ratnārci, when the queen of a universal monarch, Offered a fan with a jewel handle To the well-gone Source of Qualities And in doing so first gave rise to the mind of awakening.
